In [36]:
'''Series are a couple of elements kinda like the dictionary'''

'Series are a couple of elements kinda like the dictionary'

In [37]:
import pandas as pd
import numpy as np

In [38]:
#create a series that means create a sequence of numbers where each one is assigned by the index
obj = pd.Series([3,7,5,8])
print(obj) #first column is the index column, while the second is for the vaues

0    3
1    7
2    5
3    8
dtype: int64

In [39]:
#let's have just the column value as output and then just the index column
print(obj.values)
print(obj.index)

[3 7 5 8]
RangeIndex(start=0, stop=4, step=1)

In [40]:
#Actually i can change also the index column as i want, but for default the system just give you the sort numbers from 0 to n-1

obj2 = pd.Series([3,6,8,2], index=(['a','b','c','d']))
print(obj2)

a    3
b    6
c    8
d    2
dtype: int64

In [41]:
#to find the value based on the index:
obj2['c']

np.int64(8)

In [42]:
#Lets change the value of the index d
obj2['d'] = 17
obj2['d']

np.int64(17)

In [43]:
#lets try the slicing
obj2['b':'c']

b    6
c    8
dtype: int64

In [44]:
#if a use the '>' or '<' it will return the boolean array
obj2 <=6

a     True
b     True
c    False
d    False
dtype: bool

In [45]:
#if i put the condition inside the square brackets it will return the Series with the elements that satisfy the condition
obj2[obj2 <= 6]

a    3
b    6
dtype: int64

In [46]:
#check if a index is in the Series
'l' in obj2 #or l in obj2 also in this case will research inside the indexs

False

In [47]:
#check if it is in the values
3 in obj2.values
#obj2.isin([6]) another way that return a boolean array
#obj2 == 2 same of the last comment

True

In [48]:
#sum is used for sum the '1' in the boolean array
#all is used for seeing if the condition is satisfy by all elements
#any is usef for seeing if the condition is satisfy
print(obj2)
print((obj2 == 3).any())
print((obj2 == 3).all())
print((obj2 == 3).sum())

a     3
b     6
c     8
d    17
dtype: int64
True
False
1

In [49]:
#To do the addition between two series we can not do the simple plus
#because the system usually check the index and sum just the elements 
#with the same index while the other will turn into NaN
#to avoid this we need to use the function add

obj3 = pd.Series([3, 7, 10, 6 ], index=['a','b','c','d'])

obj4 = pd.Series([3, 7, 10, 6 ], index=['a','b','l','d'])
print(obj3.add(obj4, fill_value=0))

a     6.0
b    14.0
c    10.0
d    12.0
l    10.0
dtype: float64

In [50]:
#to pass from Series to dict
obj4.to_dict()

{'a': 3, 'b': 7, 'l': 10, 'd': 6}

In [51]:
#To pass from dict to series it needed to put as argument the dict
obj5 = pd.Series(obj4)
obj5

a     3
b     7
l    10
d     6
dtype: int64

In [52]:
#check null
pd.isnull(obj5)

a    False
b    False
l    False
d    False
dtype: bool

Dropping method

In [53]:
#To drop one of the elements
obj7 = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj7

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [54]:
obj7.drop('c', inplace=True)
#or obj7 = obj7.drop('c') do it like this make sure that elements is deleted

NAMES

In [55]:
#give the name for index and for values
obj7.name = 'Numbers'
obj7.index.name = 'Letters'

In [56]:
obj7

Letters
a    0.0
b    1.0
d    3.0
e    4.0
Name: Numbers, dtype: float64

Exercise random

In [57]:
fruits_week = pd.Series([10,20,30,40,50,60,70], index=['mo','th','we','thu','fri','sat','sun'])
#select the quantity of fruit sell on saturday
fruits_week['sat']

np.int64(60)

In [58]:
#find the sum of quantity during the weekend
fruits_week['fri':].sum()

fruits_week[-3:].sum()

np.int64(180)

In [59]:
#how many days the quantity is higher than 30
(fruits_week > 30).sum()

np.int64(4)

DataFrame

In [60]:
'''We can see Dataframe as a collection of series where every column and every row
is a series.
To inizialize a DataFrame we can used a dict'''
data = {'State': ['ohio', 'ohio', 'ohio', 'Nevada'],
        'years': [2000, 2001, 2002, 2003],
        'pop' : [1.3, 1.2, 3.4, 6]
        }
frame = pd.DataFrame(data)
frame

    State  years  pop
0    ohio   2000  1.3
1    ohio   2001  1.2
2    ohio   2002  3.4
3  Nevada   2003  6.0

In [61]:
frame.shape
frame.shape[0] #number of row
frame.shape[1] #number of column

3

In [62]:
#first rows
frame.head(2)

  State  years  pop
0  ohio   2000  1.3
1  ohio   2001  1.2

In [63]:
#last rows
frame.tail(2)

    State  years  pop
2    ohio   2002  3.4
3  Nevada   2003  6.0

In [64]:
#random lines in frame
frame.sample()

  State  years  pop
2  ohio   2002  3.4

In [65]:
#knowing the name of columns

frame.columns

Index(['State', 'years', 'pop'], dtype='object')

In [66]:
#choose column
frame['years']

0    2000
1    2001
2    2002
3    2003
Name: years, dtype: int64

In [67]:
#given that a column is a series 
frame.index.values

array([0, 1, 2, 3])

In [68]:
frame1 = pd.DataFrame(data, index=np.arange(4,8))
frame1

    State  years  pop
4    ohio   2000  1.3
5    ohio   2001  1.2
6    ohio   2002  3.4
7  Nevada   2003  6.0

In [69]:
frame1.index = ['uno','due','tre','quattro']
frame1

          State  years  pop
uno        ohio   2000  1.3
due        ohio   2001  1.2
tre        ohio   2002  3.4
quattro  Nevada   2003  6.0

In [70]:
frame1.State

uno          ohio
due          ohio
tre          ohio
quattro    Nevada
Name: State, dtype: object

In [71]:
#get the second value of the column State

frame1['State'][1]

C:\Users\halima\AppData\Local\Temp\ipykernel_25060\4042132094.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  frame1['State'][1]

'ohio'

In [72]:
frame1.loc["quattro"] #access to the index modified not the std one

State    Nevada
years      2003
pop         6.0
Name: quattro, dtype: object

In [73]:
frame1.iloc[3] # numerical index std given by pandas

State    Nevada
years      2003
pop         6.0
Name: quattro, dtype: object

In [74]:
frame1.loc["quattro"][0] #access row index four and column 0 = state
#frame1.loc["quattro"] this is a series

C:\Users\halima\AppData\Local\Temp\ipykernel_25060\1875807171.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  frame1.loc["quattro"][0] #access row index four and column 0 = state

'Nevada'

In [75]:
#specified row first and then column
frame1.loc['due':'quattro',"years"]

due        2001
tre        2002
quattro    2003
Name: years, dtype: int64

In [76]:
frame1.iloc[1:4,1] #another way based on the std index 1:03:42

due        2001
tre        2002
quattro    2003
Name: years, dtype: int64

In [77]:
import pandas as pd
import numpy as np
datanew = pd.DataFrame(np.arange(20).reshape(4,5), index=["ohio","colorado","utah","ny"], columns=["zero","one","two","three","four"])
datanew

          zero  one  two  three  four
ohio         0    1    2      3     4
colorado     5    6    7      8     9
utah        10   11   12     13    14
ny          15   16   17     18    19

In [78]:
datanew.loc["ohio":"utah","two"]

ohio         2
colorado     7
utah        12
Name: two, dtype: int64

In [79]:
datanew.iloc[0:3,2]

ohio         2
colorado     7
utah        12
Name: two, dtype: int64

Filtering

In [80]:
datanew["three"] > 5

ohio        False
colorado     True
utah         True
ny           True
Name: three, dtype: bool

In [81]:
datanew[datanew >= 12] #if want just the value that make ensure the condizion

          zero   one   two  three  four
ohio       NaN   NaN   NaN    NaN   NaN
colorado   NaN   NaN   NaN    NaN   NaN
utah       NaN   NaN  12.0   13.0  14.0
ny        15.0  16.0  17.0   18.0  19.0

In [82]:
datanew >= 12 #create a boolean table

           zero    one    two  three   four
ohio      False  False  False  False  False
colorado  False  False  False  False  False
utah      False  False   True   True   True
ny         True   True   True   True   True

In [83]:
#conbinations of conditions
[(datanew.three > 5) & (datanew['four'] < 15)]

[ohio        False
 colorado     True
 utah         True
 ny          False
 dtype: bool]

modify DF

In [84]:
data_copy_ref = datanew #as refer
data_copy = datanew.copy()
data_view = datanew.iloc[2:,1:-1]

In [85]:
data_copy_ref[data_copy_ref >=12] = 100
data_copy_ref

          zero  one  two  three  four
ohio         0    1    2      3     4
colorado     5    6    7      8     9
utah        10   11  100    100   100
ny         100  100  100    100   100

In [86]:
data_copy[data_copy < 7] = 34
data_copy

          zero  one  two  three  four
ohio        34   34   34     34    34
colorado    34   34    7      8     9
utah        10   11   12     13    14
ny          15   16   17     18    19

In [87]:
data_copy_ref
datanew

          zero  one  two  three  four
ohio         0    1    2      3     4
colorado     5    6    7      8     9
utah        10   11  100    100   100
ny         100  100  100    100   100

In [92]:
frame1

          State  years  pop
uno        ohio   2000  1.3
due        ohio   2001  1.2
tre        ohio   2002  3.4
quattro  Nevada   2003  6.0

In [93]:
frame

    State  years  pop
0    ohio   2000  1.3
1    ohio   2001  1.2
2    ohio   2002  3.4
3  Nevada   2003  6.0

In [101]:
frame1["debt"] = 16.5
frame1

          State  years  pop  debt
uno        ohio   2000  1.3  16.5
due        ohio   2001  1.2  16.5
tre        ohio   2002  3.4  16.5
quattro  Nevada   2003  6.0  16.5

In [103]:
val = pd.Series([-1.2,-1.5,-1.7,-3], index=["uno","due","tre","quattro"])
frame1["debt"] = val
frame1

          State  years  pop  debt
uno        ohio   2000  1.3  -1.2
due        ohio   2001  1.2  -1.5
tre        ohio   2002  3.4  -1.7
quattro  Nevada   2003  6.0  -3.0

In [155]:

frame1

          State  years  pop  debt
uno        ohio   2000  1.3  -1.2
due        ohio   2001  1.2  -1.5
quattro  Nevada   2003  6.0  -3.0

Arithmetic

In [ ]:
data_copy + datanew
#fill value when there isn't a match between indexs

          zero  one  two  three  four
ohio        34   35   36     37    38
colorado    39   40   14     16    18
utah        20   22  112    113   114
ny         115  116  117    118   119

In [ ]:
data_copy.reindex(columns=['z'], fill_value=500)
#if you putt all the columns sorting you can also add another one

            z
ohio      500
colorado  500
utah      500
ny        500

In [128]:
datanew.describe()

             zero         one         two       three        four
count    4.000000    4.000000    4.000000    4.000000    4.000000
mean    28.750000   29.500000   52.250000   52.750000   53.250000
std     47.675116   47.176972   55.174722   54.597772   54.020829
min      0.000000    1.000000    2.000000    3.000000    4.000000
25%      3.750000    4.750000    5.750000    6.750000    7.750000
50%      7.500000    8.500000   53.500000   54.000000   54.500000
75%     32.500000   33.250000  100.000000  100.000000  100.000000
max    100.000000  100.000000  100.000000  100.000000  100.000000

In [129]:
datanew.info()
#for each column there is a value for the numbers of nan and one for the type

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ohio to ny
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   zero    4 non-null      int64
 1   one     4 non-null      int64
 2   two     4 non-null      int64
 3   three   4 non-null      int64
 4   four    4 non-null      int64
dtypes: int64(5)
memory usage: 364.0+ bytes

In [136]:
datanew.sum(axis="columns")

ohio         10
colorado     35
utah        321
ny          500
dtype: int64

In [142]:
#datanew.max(axis="columns")
datanew.max()

zero     100
one      100
two      100
three    100
four     100
dtype: int64

SERIES OBJ

In [147]:
obj99 =  pd.Series(['a','b','c','d','a','b'])
obj99

0    a
1    b
2    c
3    d
4    a
5    b
dtype: object

In [148]:
uniques =  obj99.unique()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [149]:
obj99.value_counts()

a    2
b    2
c    1
d    1
Name: count, dtype: int64

In [151]:
obj99

0    a
1    b
2    c
3    d
4    a
5    b
dtype: object

In [154]:
obj99.map(lambda x: x in ['c','a'])

0     True
1    False
2     True
3    False
4     True
5    False
dtype: bool